In [28]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
from sklearn.tree import DecisionTreeClassifier
from sklearn import tree
from sklearn.metrics import classification_report
from sklearn import preprocessing
from sklearn.model_selection import train_test_split
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score

In [29]:
fraud = pd.read_csv("Fraud_check.csv")

In [30]:
fraud.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO

In [31]:
# Checking the number of rows and columns
fraud.shape

(600, 6)

In [32]:
# Checking for null values
fraud.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
dtypes: int64(3), object(3)
memory usage: 28.2+ KB

In [33]:
# Renaming the columns 

fraud.rename({'Undergrad':'UG','Marital.Status':'MS', 'Taxable.Income':'TI', 'City.Population':'CP', 'Work.Experience':'WE'},axis = 1, inplace = True)

In [34]:
fraud.head()

    UG        MS     TI      CP  WE Urban
0   NO    Single  68833   50047  10   YES
1  YES  Divorced  33700  134075  18   YES
2   NO   Married  36925  160205  30   YES
3  YES    Single  50190  193264  15   YES
4   NO   Married  81002   27533  28    NO

In [35]:
# Categorizing the tax column based on the condition

fraud['TI'] = fraud.TI.map(lambda taxable_income : 'Risky' if taxable_income <= 30000 else 'Good')

In [36]:
fraud.head()

    UG        MS    TI      CP  WE Urban
0   NO    Single  Good   50047  10   YES
1  YES  Divorced  Good  134075  18   YES
2   NO   Married  Good  160205  30   YES
3  YES    Single  Good  193264  15   YES
4   NO   Married  Good   27533  28    NO

In [37]:
# Converting the categorical columns to proper datatypes

fraud['UG'] = fraud['UG'].astype("category")
fraud['MS'] = fraud['MS'].astype("category")
fraud['Urban'] = fraud['Urban'].astype("category")
fraud['TI'] = fraud['TI'].astype("category")

In [38]:
fraud.dtypes

UG       category
MS       category
TI       category
CP          int64
WE          int64
Urban    category
dtype: object

In [39]:
# Encoding the categorical columns by using label encoder

label_encoder = preprocessing.LabelEncoder()
fraud['UG'] = label_encoder.fit_transform(fraud['UG'])

fraud['MS'] = label_encoder.fit_transform(fraud['MS'])

fraud['Urban'] = label_encoder.fit_transform(fraud['Urban'])

fraud['TI'] = label_encoder.fit_transform(fraud['TI'])

In [40]:
fraud

     UG  MS  TI      CP  WE  Urban
0     0   2   0   50047  10      1
1     1   0   0  134075  18      1
2     0   1   0  160205  30      1
3     1   2   0  193264  15      1
4     0   1   0   27533  28      0
..   ..  ..  ..     ...  ..    ...
595   1   0   0   39492   7      1
596   1   0   0   55369   2      1
597   0   0   0  154058   0      1
598   1   1   0  180083  17      0
599   0   0   0  158137  16      0

[600 rows x 6 columns]

In [41]:
fraud['TI'].unique()

array([0, 1])

In [42]:
fraud['TI'].value_counts()

0    476
1    124
Name: TI, dtype: int64

In [43]:
# Splitting the data into x and y as input and output

X = fraud.iloc[:,[0,1,3,4,5]]
Y = fraud.iloc[:,2]

In [44]:
X

     UG  MS      CP  WE  Urban
0     0   2   50047  10      1
1     1   0  134075  18      1
2     0   1  160205  30      1
3     1   2  193264  15      1
4     0   1   27533  28      0
..   ..  ..     ...  ..    ...
595   1   0   39492   7      1
596   1   0   55369   2      1
597   0   0  154058   0      1
598   1   1  180083  17      0
599   0   0  158137  16      0

[600 rows x 5 columns]

In [45]:
Y

0      0
1      0
2      0
3      0
4      0
      ..
595    0
596    0
597    0
598    0
599    0
Name: TI, Length: 600, dtype: int32

In [46]:
# Splitting the data into training and test dataset

x_train,x_test,y_train,y_test = train_test_split(X,Y, test_size = 0.3, random_state = 10)

In [47]:

from sklearn.ensemble import RandomForestClassifier
rf = RandomForestClassifier(n_jobs=3,oob_score=True,n_estimators=15,max_features=4,criterion="entropy")

In [48]:
#Building a model using Random Forest

In [49]:
rf.fit(x_train,y_train) # Fitting RandomForestClassifier model from sklearn.ensemble 
rf.estimators_ # 
rf.classes_ # class labels (output)
rf.n_classes_ # Number of levels in class labels 
rf.n_features_  # Number of input features in model 8 here.

rf.n_outputs_ # Number of outputs when fit performed

1

In [50]:
preds = rf.predict(x_test)
preds

array([0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0])

In [51]:
pd.Series(preds).value_counts()

0    160
1     20
dtype: int64

In [52]:
crosstable = pd.crosstab(preds,y_test)
crosstable

TI       0   1
row_0
0      121  39
1       17   3

In [53]:
np.mean(preds==y_test)

0.6888888888888889

In [54]:
print(classification_report(preds,y_test))

              precision    recall  f1-score   support

           0       0.88      0.76      0.81       160
           1       0.07      0.15      0.10        20

    accuracy                           0.69       180
   macro avg       0.47      0.45      0.45       180
weighted avg       0.79      0.69      0.73       180